Natalia-Test/integrator/ACAMO-integrator-tool/templates/deleteEventFromICMore

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/07/secext" 
    xmlns:int="urn:crmondemand/ws/integrationevent/">
    <soapenv:Header>
        <wsse:Security soapenv:mustUnderstand="1">
            <wsse:UsernameToken>
                <wsse:Username>${getICMoreUserName(body.variables.queuename)}</wsse:Username>
                <wsse:Password Type="wsse:PasswordText">${getICMorePassword(body.variables.queuename)}</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <int:IntegrationEventWS_DeleteEvents_Input>
            <int:LastEventId>${body.variables.EVENT_LastEventId}</int:LastEventId>
            <!--Optional:-->
            <int:QueueName>Spain</int:QueueName>
        </int:IntegrationEventWS_DeleteEvents_Input>
    </soapenv:Body>
</soapenv:Envelope>